{"_path":"/en/docs/eula","_dir":"docs","_draft":false,"_partial":false,"_locale":"","title":"Maxthon Software and Services Terms of Service & End User License Agreement","description":"These Terms of Service apply to the executable code version of Maxthon Browsers for Desktop, Maxthon Browsers for mobile devices and tablet computers, passport web services and Maxthon cloud services and cloud powered Services.","body":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"maxthon-software-and-services-terms-of-service-end-user-license-agreement"},"children":[{"type":"text","value":"Maxthon Software and Services Terms of Service & End User License Agreement"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These Terms of Service apply to the executable code version of Maxthon Browsers for Desktop, Maxthon Browsers for mobile devices and tablet computers, passport web services and Maxthon cloud services and cloud powered Services."}]},{"type":"element","tag":"h2","props":{"id":"_1-your-relationship-with-maxthon"},"children":[{"type":"text","value":"1. Your relationship with Maxthon"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Your use of Maxthon's products, software, services and web sites (referred to collectively as the \"Services\" in this document and excluding any services provided to you by Maxthon under a separate written agreement) is subject to the terms of this legal agreement between you and Maxthon. \"Maxthon\" means Maxthon (Asia) Ltd., whose principal place of business is at Maxthon (Asia) Ltd., 71 Stevenson St, Ste. 417, San Francisco CA 94105. This document explains how the agreement is made up, and sets out some of the terms of that agreement."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Unless otherwise agreed in writing with Maxthon, your agreement with Maxthon will always include, at a minimum, the terms and conditions set out in this document. These are referred to below as the \"Universal Terms\"."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Your agreement with Maxthon also includes the terms of any legal notices applicable to the Services, in addition to the Universal Terms. Any such additional terms arising as the result of legal notices are referred to as the \"Additional Terms\". Where Additional Terms apply to a Service, these will be accessible for you to read either within, or through your use of, that Service."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"These Universal Terms, together with the Additional Terms, form a legally binding agreement between you and Maxthon in relation to your use of the Services. It is important that you take the time to read them carefully. The Universal Terms and the Additional Terms, together, are referred to as the \"Terms\"."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"If there is any contradiction between what the Additional Terms say and what the Universal Terms say, then the Additional Terms shall take precedence in relation to that Service."}]}]},{"type":"element","tag":"h2","props":{"id":"_2-accepting-the-terms"},"children":[{"type":"text","value":"2. Accepting the Terms"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"In order to use the Services, you must first agree to the Terms. You may not use the Services if you do not accept the Terms."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You can accept the Terms by:\n"},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Clicking to accept or agree to the Terms, where this option is made available to you by Maxthon in the user interface for any Service; or"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"By actually using the Services. In this case, you understand and agree that Maxthon will treat your use of the Services as acceptance of the Terms from that point onwards."}]}]}]}]},{"type":"element","tag":"h2","props":{"id":"_3-the-language-of-the-terms"},"children":[{"type":"text","value":"3. The Language of the Terms"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Where Maxthon has provided you with a translation of the English language version of the Terms, then you agree that the translation is provided for your convenience only and that the English language versions of the Terms will govern your relationship with Maxthon."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"If there is any contradiction between what the English language version of the Terms says and what a translation says, then the English language version shall take precedence."}]}]},{"type":"element","tag":"h2","props":{"id":"_4-maxthons-provision-of-the-services"},"children":[{"type":"text","value":"4. Maxthon's Provision of the Services"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Maxthon has partners and affiliated legal entities around the world (\"Subsidiaries and Affiliates\"). Sometimes, these companies will be providing the Services to you on behalf of Maxthon itself. You acknowledge and agree that Subsidiaries and Affiliates will be entitled to provide the Services to you."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Maxthon is constantly innovating in order to provide the best possible experience for its users. You acknowledge and agree that the form and nature of the Services which Maxthon provides may change from time to time without prior notice to you."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"As part of this continuing innovation, you acknowledge and agree that Maxthon may stop (permanently or temporarily) providing the Services (or any features within the Services) to you or to users generally at Maxthon's sole discretion, without prior notice to you. You may stop using the Services at any time. You do not need to specifically inform Maxthon when you stop using the Services."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You acknowledge and agree that if Maxthon disables access to your account, you may be prevented from accessing the Services, your account details or any files or other content which is contained in your account."}]}]},{"type":"element","tag":"h2","props":{"id":"_5-your-use-of-the-services"},"children":[{"type":"text","value":"5. Your Use of the Services"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You agree to use the Services only for purposes that are permitted by (a) the Terms and (b) any applicable law, regulation or generally accepted practices or guidelines in the relevant jurisdictions (including any laws regarding the export of data or software to and from the United States or other relevant countries)."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You agree that you will not engage in any activity that interferes with or disrupts the Services (or the servers and networks which are connected to the Services)."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Unless you have been specifically permitted to do so in a separate agreement with Maxthon, you agree that you will not reproduce, duplicate, copy, sell, trade or resell the Services for any purpose."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You agree that you are solely responsible for (and that Maxthon has no responsibility to you or to any third party for) any breach of your obligations under the Terms and for the consequences (including any loss or damage which Maxthon may suffer) of any such breach."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You may interact with other users on or through the Services. You agree that any such interactions do not involve Maxthon and are solely between you and the other user(s)."}]}]},{"type":"element","tag":"h2","props":{"id":"_6-privacy-and-your-personal-information"},"children":[{"type":"text","value":"6. Privacy and your personal information"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"For information about Maxthon's data protection practices, please read "},{"type":"element","tag":"a","props":{"href":"https://www.maxthon.com/en/docs/privacy","rel":["nofollow"]},"children":[{"type":"text","value":"Maxthon's privacy policy"}]},{"type":"text","value":". This policy explains how Maxthon treats your personal information, and protects your privacy, when you use the Services."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You agree to the use of your data in accordance with Maxthon's privacy policies."}]}]},{"type":"element","tag":"h2","props":{"id":"_7-content-in-the-services"},"children":[{"type":"text","value":"7. Content in the Services"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You understand that all information (such as data files, written text, computer software, music, audio files or other sounds, photographs, videos or other images) which you may have access to as part of, or through your use of, the Services are the sole responsibility of the person from which such content originated. All such information is referred to as the \"Content\"."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You should be aware that Content presented to you as part of the Services, including but not limited to advertisements in the Services and sponsored Content within the Services, may be protected by intellectual property rights which are owned by the sponsors or advertisers who provide that Content to Maxthon (or by other persons or companies on their behalf). You may not modify, rent, lease, loan, sell, distribute or create derivative works based on this Content (either in whole or in part) unless you have been specifically told that you may do so by Maxthon or by the owners of that Content, in a separate agreement."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Maxthon reserves the right (but shall have no obligation) to pre-screen, review, flag, filter, modify, refuse or remove any or all Content from any Service."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You understand that by using the Services you may be exposed to Content that you may find offensive, indecent or objectionable and that, in this respect, you use the Services at your own risk."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You agree that you are solely responsible for (and that Maxthon has no responsibility to you or to any third party for) any Content that you create, transmit or display while using the Services and for the consequences of your actions (including any loss or damage which Maxthon may suffer) by doing so."}]}]},{"type":"element","tag":"h2","props":{"id":"_8-allegations-of-copyright-infringement"},"children":[{"type":"text","value":"8. Allegations of Copyright Infringement"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"It is Maxthon's policy to respond to notices of alleged copyright infringement that comply with applicable international intellectual property law (including, in the United States, the Digital Millennium Copyright Act) and to terminate the accounts of repeat infringers."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You may notify Maxthon of copyright infringement on the Service by providing notice\n"},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"by email with \"Copyright Notification\" in the subject line to "},{"type":"element","tag":"a","props":{"href":"mailto:business@maxthon.com"},"children":[{"type":"text","value":"business@maxthon.com"}]},{"type":"text","value":"."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"by a document titled \"Copyright Notification\" mailed to Maxthon, Attn: Copyright Agent, Maxthon (Asia) Ltd., 71 Stevenson St, Ste. 417, San Francisco CA 94105 USA."}]}]}]}]},{"type":"element","tag":"h3","props":{"id":"your-notice-must"},"children":[{"type":"text","value":"Your notice must:"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Identify the original copyrighted work you claim is infringed;"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Identify the content on the Service that you claim is infringing the copyrighted work. Please provide enough detail for Maxthon to locate the allegedly infringing content on the Service;"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Provide your contact information, including your full name, mailing address, telephone number, and email address;"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Provide a statement that you have a good faith belief that the use of the content in the manner complained of is not authorized by the copyright owner, its agent, or the law;"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Provide this statement: \"I swear, under penalty of perjury, that the information in this notification and complaint is accurate and that I am the copyright owner, or am authorized to act on behalf of the copyright owner of an exclusive right that is infringed.\"; and"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Include your signature."}]}]},{"type":"element","tag":"h2","props":{"id":"_9-licenses"},"children":[{"type":"text","value":"9. Licenses"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Maxthon does not claim ownership in your Material. Your submission of Material to the Service does not transfer ownership rights in the Material to Maxthon."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"However, by submitting Material to the Service you grant Maxthon a worldwide non-exclusive, assignable, fully paid, royalty-free, perpetual and irrevocable license to use, copy, publicly perform, display, distribute and modify the Material, and to prepare derivative works thereof, or incorporate the Material into other works as well as sublicense the same."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Users of the Service are granted a non-exclusive, non-transferable, revocable license (revocable at the sole discretion of Maxthon at any time) to access and use the Service strictly in accordance with the Terms. Any further intellectual property rights in any information or content in the Service are not granted."}]}]},{"type":"element","tag":"h2","props":{"id":"_10-fees"},"children":[{"type":"text","value":"10. Fees"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Your use of the Service may be or may become subject to charges."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Any fees charged by Maxthon will be announced separately in connection with the Service."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Use of the Service may involve transmission of data through your service provider's network. Your network service provider may charge for such data transmission."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Maxthon assumes no responsibility for the payment of any charges."}]}]},{"type":"element","tag":"h2","props":{"id":"_11-proprietary-rights"},"children":[{"type":"text","value":"11. Proprietary rights"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You acknowledge and agree that Maxthon (or Maxthon's licensors) own all legal right, title and interest in and to the Services, including any intellectual property rights which subsist in the Services (whether those rights happen to be registered or not, and wherever in the world those rights may exist)."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Unless you have agreed otherwise in writing with Maxthon, nothing in the Terms gives you a right to use any of Maxthon's trade names, trade marks, service marks, logos, domain names, and other distinctive brand features."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"If you have been given an explicit right to use any of these brand features in a separate written agreement with Maxthon, then you agree that your use of such features shall be in compliance with that agreement, any applicable provisions of the Terms, and Maxthon's brand feature use guidelines as updated from time to time. Information on these guidelines can be provided by emailing "},{"type":"element","tag":"a","props":{"href":"mailto:brand@maxthon.com"},"children":[{"type":"text","value":"brand@maxthon.com"}]},{"type":"text","value":"."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Maxthon acknowledges and agrees that it obtains no right, title or interest from you (or your licensors) under these Terms in or to any Content that you submit, post, transmit or display on, or through, the Services, including any intellectual property rights which subsist in that Content (whether those rights happen to be registered or not, and wherever in the world those rights may exist). Unless you have agreed otherwise in writing with Maxthon, you agree that you are responsible for protecting and enforcing those rights and that Maxthon has no obligation to do so on your behalf."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You agree that you shall not remove, obscure, or alter any proprietary rights notices (including copyright and trade mark notices) which may be affixed to or contained within the Services."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You agree that in using the Services, you will not use any trade mark, service mark, trade name, logo of any company or organization in a way that is likely or intended to cause confusion about the owner or authorized user of such marks, names or logos."}]}]},{"type":"element","tag":"h2","props":{"id":"_12-license-from-maxthon"},"children":[{"type":"text","value":"12. License from Maxthon"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Maxthon gives you a personal, worldwide, royalty-free, non-assignable and non-exclusive license to use the software provided to you by Maxthon as part of the Services (referred to as the \"Software\"). This license is for the sole purpose of enabling you to use and enjoy the benefit of the Services as provided by Maxthon, in the manner permitted by the Terms."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You may not (and you may not permit anyone else) to copy, modify, create a derivative work of, reverse engineer, decompile or otherwise attempt to extract the source code of the Software or any part thereof, unless this is expressly permitted or required by law, or unless you have been specifically told that you may do so by Maxthon, in writing."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Unless Maxthon has given you specific written permission to do so, you may not assign (or grant a sub-license of) your rights to use the Software, grant a security interest in or over your rights to use the Software, or otherwise transfer any part of your rights to use the Software."}]}]},{"type":"element","tag":"h2","props":{"id":"_13-software-updates-and-how-to-change-settings-and-uninstall"},"children":[{"type":"text","value":"13. Software updates and how to change settings and uninstall"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The Software, which you use, may automatically download and install updates from time to time from Maxthon. These updates are designed to improve, enhance and further develop the Services and may take the form of bug fixes, enhanced functions, new software modules and completely new versions. You agree to receive such updates (and permit Maxthon to deliver these to you) as part of your use of the Services.To learn more about features, settings and uninstall procedures of any Maxthon software, we encourage you to visit the respective help sections "},{"type":"element","tag":"a","props":{"href":"https://docs.maxthon.com/","rel":["nofollow"]},"children":[{"type":"text","value":"Maxthon Help"}]},{"type":"text","value":"."}]},{"type":"element","tag":"h2","props":{"id":"_14-ending-your-relationship-with-maxthon"},"children":[{"type":"text","value":"14. Ending your relationship with Maxthon"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"The Terms will continue to apply until terminated by either you or Maxthon as set out below."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Maxthon may at any time, terminate its legal agreement with you if:\n"},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You have breached any provision of the Terms (or have acted in manner which clearly shows that you do not intend to, or are unable to comply with the provisions of the Terms); or"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Maxthon is required to do so by law (for example, where the provision of the Services to you is, or becomes, unlawful); or"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"The partner with whom Maxthon offered the Services to you (if any) has terminated its relationship with Maxthon or ceased to offer the Services to you; or"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Maxthon is transitioning to no longer providing the Services to users in the country in which you are resident or from which you use the Services; or"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"The provision of the Services to you by Maxthon is, in Maxthon's opinion, no longer commercially viable."}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Nothing in this Section shall affect Maxthon's rights regarding provision of Services under Section 4 of the Terms."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"When these Terms come to an end, all of the legal rights, obligations and liabilities that you and Maxthon have benefited from, been subject to (or which have accrued over time whilst the Terms have been in force) or which are expressed to continue indefinitely, shall be unaffected by this cessation."}]}]},{"type":"element","tag":"h2","props":{"id":"_15-exclusion-of-warranties"},"children":[{"type":"text","value":"15. EXCLUSION OF WARRANTIES"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"NOTHING IN THESE TERMS SHALL EXCLUDE OR LIMIT MAXTHON's WARRANTY OR LIABILITY FOR LOSSES WHICH MAY NOT BE LAWFULLY EXCLUDED OR LIMITED BY APPLICABLE LAW. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF CERTAIN WARRANTIES OR CONDITIONS OR THE LIMITATION OR EXCLUSION OF LIABILITY FOR LOSS OR DAMAGE CAUSED BY NEGLIGENCE, BREACH OF CONTRACT OR BREACH OF IMPLIED TERMS, OR INCIDENTAL OR CONSEQUENTIAL DAMAGES. ACCORDINGLY, ONLY THE LIMITATIONS WHICH ARE LAWFUL IN YOUR JURISDICTION WILL APPLY TO YOU AND OUR LIABILITY WILL BE LIMITED TO THE MAXIMUM EXTENT PERMITTED BY LAW."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"YOU EXPRESSLY UNDERSTAND AND AGREE THAT YOUR USE OF THE SERVICES IS AT YOUR SOLE RISK AND THAT THE SERVICES ARE PROVIDED \"AS IS\" AND \"AS AVAILABLE\"."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"IN PARTICULAR, MAXTHON, ITS SUBSIDIARIES AND AFFILIATES, AND ITS LICENSORS DO NOT REPRESENT OR WARRANT TO YOU THAT:\n"},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"YOUR USE OF THE SERVICES WILL MEET YOUR REQUIREMENTS,"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"YOUR USE OF THE SERVICES WILL BE UNINTERRUPTED, TIMELY, SECURE OR FREE FROM ERROR,"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"ANY INFORMATION OBTAINED BY YOU AS A RESULT OF YOUR USE OF THE SERVICES WILL BE ACCURATE OR RELIABLE, AND"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"ANY DEFECTS IN THE OPERATION OR FUNCTIONALITY OF ANY SOFTWARE PROVIDED TO YOU AS PART OF THE SERVICES WILL BE CORRECTED."}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"ANY MATERIAL DOWNLOADED OR OTHERWISE OBTAINED THROUGH THE USE OF THE SERVICES IS DONE AT YOUR OWN DISCRETION AND RISK AND YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR COMPUTER SYSTEM OR OTHER DEVICE OR LOSS OF DATA THAT RESULTS FROM THE DOWNLOAD OF ANY SUCH MATERIAL."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"NO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED BY YOU FROM MAXTHON OR THROUGH OR FROM THE SERVICES SHALL CREATE ANY WARRANTY NOT EXPRESSLY STATED IN THE TERMS."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"MAXTHON FURTHER EXPRESSLY DISCLAIMS ALL WARRANTIES AND CONDITIONS OF ANY KIND, WHETHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO THE IMPLIED WARRANTIES AND CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT."}]}]},{"type":"element","tag":"h2","props":{"id":"_16-limitation-of-liability"},"children":[{"type":"text","value":"16. LIMITATION OF LIABILITY"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"SUBJECT TO OVERALL PROVISION IN PARAGRAPH 15.1 ABOVE, YOU EXPRESSLY UNDERSTAND AND AGREE THAT MAXTHON, ITS SUBSIDIARIES AND AFFILIATES, AND ITS LICENSORS SHALL NOT BE LIABLE TO YOU FOR:\n"},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL CONSEQUENTIAL OR EXEMPLARY DAMAGES WHICH MAY BE INCURRED BY YOU, HOWEVER CAUSED AND UNDER ANY THEORY OF LIABILITY. THIS SHALL INCLUDE, BUT NOT BE LIMITED TO, ANY LOSS OF PROFIT (WHETHER INCURRED DIRECTLY OR INDIRECTLY), ANY LOSS OF GOODWILL OR BUSINESS REPUTATION, ANY LOSS OF DATA SUFFERED, COST OF PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES, OR OTHER INTANGIBLE LOSS;"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"ANY LOSS OR DAMAGE WHICH MAY BE INCURRED BY YOU, INCLUDING BUT NOT LIMITED TO LOSS OR DAMAGE AS A RESULT OF:\n"},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"ANY RELIANCE PLACED BY YOU ON THE COMPLETENESS, ACCURACY OR EXISTENCE OF ANY ADVERTISING, OR AS A RESULT OF ANY RELATIONSHIP OR TRANSACTION BETWEEN YOU AND ANY ADVERTISER OR SPONSOR WHOSE ADVERTISING APPEARS ON THE SERVICES;"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"ANY CHANGES WHICH MAXTHON MAY MAKE TO THE SERVICES, OR FOR ANY PERMANENT OR TEMPORARY CESSATION IN THE PROVISION OF THE SERVICES (OR ANY FEATURES WITHIN THE SERVICES);"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"THE DELETION OF, CORRUPTION OF, OR FAILURE TO STORE, ANY CONTENT AND OTHER COMMUNICATIONS DATA MAINTAINED OR TRANSMITTED BY OR THROUGH YOUR USE OF THE SERVICES;"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"YOUR FAILURE TO PROVIDE MAXTHON WITH ACCURATE ACCOUNT INFORMATION;"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"YOUR FAILURE TO KEEP YOUR PASSWORD OR ACCOUNT DETAILS SECURE AND CONFIDENTIAL."}]}]}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"THE LIMITATIONS ON MAXTHON's LIABILITY TO YOU IN PARAGRAPH 16.1 ABOVE SHALL APPLY WHETHER OR NOT MAXTHON HAS BEEN ADVISED OF OR SHOULD HAVE BEEN AWARE OF THE POSSIBILITY OF ANY SUCH LOSSES ARISING."}]}]},{"type":"element","tag":"h2","props":{"id":"_17-advertisements"},"children":[{"type":"text","value":"17. Advertisements"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Some of the Services are supported by advertising revenue and may display advertisements and promotions. These advertisements may be targeted to the content of information stored on the Services, queries made through the Services or other information."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"The manner, mode and extent of advertising by Maxthon on the Services are subject to change without specific notice to you."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"In consideration for Maxthon granting you access to and use of the Services, you agree that Maxthon may place such advertising on the Services."}]}]},{"type":"element","tag":"h2","props":{"id":"_18-third-party-links"},"children":[{"type":"text","value":"18. Third Party Links"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The Services may contain links to third-party services such as third party websites, applications, or ads (\"Third-Party Links\"). When you click on such a link, we will not warn you that you have left the Services. Maxthon does not control and is not responsible for Third-Party Links. Your use of all Third-Party Links is subject to your acceptance of such Third Party Links applicable terms of use."}]},{"type":"element","tag":"h2","props":{"id":"_19-other-content"},"children":[{"type":"text","value":"19. Other content"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"The Services may include hyperlinks to other web sites or content or resources. Maxthon has no control over any web sites or resources which are provided by companies or persons other than Maxthon."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You acknowledge and agree that Maxthon is not responsible for the availability of any such external sites or resources, and does not endorse any advertising, products or other materials on or available from such web sites or resources."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You acknowledge and agree that Maxthon is not liable for any loss or damage which may be incurred by you as a result of the availability of those external sites or resources, or as a result of any reliance placed by you on the completeness, accuracy or existence of any advertising, products or other materials on, or available from, such web sites or resources."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Sometimes when you use the Services, you may (as a result of, or in connection with your use of the Services) use a service or download a piece of software, or purchase goods, which are provided by another person or company. Your use of these other services, software or goods may be subject to separate terms between you and the company or person concerned. If so, the Terms do not affect your legal relationship with these other companies or individuals."}]}]},{"type":"element","tag":"h2","props":{"id":"_20-changes-to-the-terms"},"children":[{"type":"text","value":"20. Changes to the Terms"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Maxthon may make changes to the Universal Terms or Additional Terms from time to time. When these changes are made, Maxthon will make a new copy of the Universal Terms available "},{"type":"element","tag":"a","props":{"href":"https://docs.maxthon.com/eula","rel":["nofollow"]},"children":[{"type":"text","value":"here"}]},{"type":"text","value":" and any new Additional Terms will be made available to you from within, or through, the affected Services."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You understand and agree that if you use the Services after the date on which the Universal Terms or Additional Terms have changed, Maxthon will treat your use as acceptance of the updated Universal Terms or Additional Terms."}]}]},{"type":"element","tag":"h2","props":{"id":"_21-general-legal-terms"},"children":[{"type":"text","value":"21. General legal terms"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"The Terms constitute the whole legal agreement between you and Maxthon and govern your use of the Services (but excluding any services which Maxthon may provide to you under a separate written agreement), and completely replace any prior agreements between you and Maxthon in relation to the Services."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You agree that Maxthon may provide you with notices, including those regarding changes to the Terms, by email, regular mail, or postings on the Services."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You agree that if Maxthon does not exercise or enforce any legal right or remedy which is contained in the Terms (or which Maxthon has the benefit of under any applicable law), this will not be taken to be a formal waiver of Maxthon's rights and that those rights or remedies will still be available to Maxthon."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"If any court of law, having the jurisdiction to decide on this matter, rules that any provision of these Terms is invalid, then that provision will be removed from the Terms without affecting the rest of the Terms. The remaining provisions of the Terms will continue to be valid and enforceable."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"You acknowledge and agree that each member of the group of companies of which Maxthon is the parent shall be third party beneficiaries to the Terms and that such other companies shall be entitled to directly enforce, and rely upon, any provision of the Terms which confers a benefit on (or rights in favor of) them. Other than this, no other person or company shall be third party beneficiaries to the Terms."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"The Terms, and your relationship with Maxthon under the Terms, shall be governed by the laws of the State of California without regard to its conflict of laws provisions. You and Maxthon agree to submit to the exclusive jurisdiction of the courts located within the county of Santa Clara, California to resolve any legal matter arising from the Terms. Notwithstanding this, you agree that Maxthon shall still be allowed to apply for injunctive remedies (or an equivalent type of urgent legal relief) in any jurisdiction."}]}]},{"type":"element","tag":"h2","props":{"id":"_22-additional-terms-for-extensions-for-maxthon-browsers"},"children":[{"type":"text","value":"22. Additional Terms for Extensions for Maxthon Browsers"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"These terms in this section apply if you install extensions on your copy of Maxthon Browsers. Add-ons are small software programs, developed by Maxthon or third parties that can modify and enhance the functionality of Maxthon Browsers. Add-ons may have greater privileges to access your browser or your computer than regular webpages, including the ability to read and modify your private data."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"From time to time, Maxthon Browsers may check with remote servers (hosted by Maxthon or by third parties) for available updates to aextensions, including but not limited to bug fixes or enhanced functionality. You agree that such updates will be automatically requested, downloaded, and installed without further notice to you."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"From time to time, Maxthon may discover an extension that violates Maxthon developer terms or other legal agreements, laws, regulations or policies. Maxthon Browsers will periodically download a list of such add ons from Maxthon's servers. You agree that Maxthon may remotely disable or remove any such extension from user systems in its sole discretion."}]}]},{"type":"element","tag":"h2","props":{"id":"_23-additional-terms-for-maxthon-cloud-services-and-powered-by-maxthon-cloud-services"},"children":[{"type":"text","value":"23. Additional Terms for Maxthon Cloud Services and \"Powered by Maxthon Cloud services\""}]},{"type":"element","tag":"h3","props":{"id":"_231-these-terms-in-this-section-apply-if-you-use-maxthon-cloud-services-or-a-product-labeled-powered-by-maxthon-cloud-services-on-any-device-computer-or-cloud-services-website"},"children":[{"type":"text","value":"23.1 These terms in this section apply if you use Maxthon cloud services or a product labeled \"Powered by Maxthon cloud services\" on any device, computer or cloud services website."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Add-ons are small software programs, developed by Maxthon or third parties, that can modify and enhance the functionality of Maxthon Browsers. Add-ons may have greater privileges to access your browser or your computer than regular webpages, including the ability to read and modify your private data."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The following terms of service (the \"Terms\") govern your access to and use of Maxthon cloud services and any \"Powered by Maxthon cloud services\" product, client, website and service (the \"Services\")."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You may use the Services only in compliance with these Terms. The Services reserve the right to change over time through design changes, new features and new options for use. Maxthon reserves the right to stop, suspend, or modify the Services at any time without prior notice to you. We may also remove any content from our Services at our discretion."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If your contact information, or other information related to your account, changes, you must notify Maxthon promptly and keep your information current. The Services are not intended for use by you if you are under 13 years of age. By agreeing to these Terms, you are representing to us that you are over 13."}]},{"type":"element","tag":"h3","props":{"id":"_232-maxthon-cloud-services-available-as-is"},"children":[{"type":"text","value":"23.2 Maxthon Cloud Services Available \"AS-IS\""}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"THE SERVICES AND SOFTWARE ARE PROVIDED \"AS IS\", AT YOUR OWN RISK, WITHOUT EXPRESS OR IMPLIED WARRANTY OR CONDITION OF ANY KIND. WE ALSO DISCLAIM ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT. Maxthon will have no responsibility for any harm to your computer system, loss or corruption of data, or other harm that results from your access to or use of the Services or Software."}]},{"type":"element","tag":"h3","props":{"id":"_233-user-responsibilities"},"children":[{"type":"text","value":"23.3 User Responsibilities"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Please do not copy, upload, download, or share files unless you have the right to do so. Through use of the Services you acknowledge that you are fully responsible and liable for what you copy, share, upload, download or otherwise use while using the Services. You must not upload spyware or any other malicious software to the Service."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Through use of the Services you acknowledge that you are fully responsible for maintaining and protecting all of your content in the cloud. Maxthon will not be liable for any loss or corruption of your content in the cloud, or for any costs or expenses associated with backing up or restoring any of your content in the cloud."}]},{"type":"element","tag":"h3","props":{"id":"_234-account-security"},"children":[{"type":"text","value":"23.4 Account Security"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You are responsible for safeguarding the password that you use to access the Services and you agree not to disclose your password to any third party. You are responsible for any activity using your account, whether or not you authorized that activity. You should immediately notify Maxthon of any unauthorized use of your account. You acknowledge that if you wish to protect your transmission of data or files to Maxthon, it is your responsibility to use a secure encrypted connection to communicate with the Services."}]},{"type":"element","tag":"h3","props":{"id":"_235-your-cloud-content-and-privacy"},"children":[{"type":"text","value":"23.5 Your Cloud Content and Privacy"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"By using these Maxthon Services you provide Maxthon with information, files, and folders that you submit to Maxthon's cloud services (together, \"your cloud content\"). You retain full ownership to your cloud contents. Maxthon claims no ownership to any of it. These Terms do not grant Maxthon any rights to your cloud contents or intellectual property except for the limited rights that are needed to run the Services, as explained below."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You are solely responsible for your conduct, the content of your files and folders, and your communications with others while using the Services."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maxthon is not responsible for the accuracy, completeness, appropriateness, or legality of files, user posts, or any other information you may be able to access using the Services."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maxthon may need your permission to do things you ask us to do with your cloud content, for example, hosting your files, or sharing them at your request through our \"sharing\" feature. This includes product features visible to you, the end user. For example: displaying image filenames. It also includes design choices made to technically administer our Services. For example: how the cloud services backup and store your cloud contents. Through your use of the Services you give Maxthon permission to provide the Services. This permission also extends to trusted third parties we work with to provide the Services, for example Fuhu, which is a partner of Maxthon and operates a sister product powered by cloud services named V-Drive. Another example is Amazon, who provides Maxthon with hosted storage space to provide some of the Services."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maxthon will never share your content with others, including law enforcement, for any purpose unless you direct Maxthon to do so. How we collect and use your information generally is also explained in Maxthon's Privacy Policy."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maxthon forums are public venues of comment and information sharing. Through your use you acknowledge that Maxthon has no obligation to monitor any information on the Services."}]},{"type":"element","tag":"h3","props":{"id":"_236-software-and-updates"},"children":[{"type":"text","value":"23.6 Software and Updates"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Some use of our Service requires you to download a client software package (\"Software\"). Maxthon hereby grants you a limited, nonexclusive, nontransferable, revocable license to use the Software, solely to access the Services. Your license to use the Software is automatically revoked if you violate these Terms in a manner that implicates our intellectual property rights. We hereby reserve all rights not expressly granted in these Terms. You must not reverse engineer or decompile the Software, nor attempt to do so, nor assist anyone else to do so. Our Services may update the Software on your device automatically when a new version is available."}]},{"type":"element","tag":"h3","props":{"id":"_237-termination"},"children":[{"type":"text","value":"23.7 Termination"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You can stop using our Services any time. We reserve the right to suspend or end the Services at any time, with or without cause, and with or without notice. For example, we may suspend or terminate your use if you are not complying with these Terms, or use the Services in any way that would cause us legal liability or disrupt other's use of the Services. If we suspend or terminate your use, we will try to let you know in advance and help you retrieve data, though there may be some cases (for example, repeatedly or flagrantly violating these Terms, a court order, or danger to other users) where that is not possible."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"_1-your-relationship-with-maxthon","depth":2,"text":"1. Your relationship with Maxthon"},{"id":"_2-accepting-the-terms","depth":2,"text":"2. Accepting the Terms"},{"id":"_3-the-language-of-the-terms","depth":2,"text":"3. The Language of the Terms"},{"id":"_4-maxthons-provision-of-the-services","depth":2,"text":"4. Maxthon's Provision of the Services"},{"id":"_5-your-use-of-the-services","depth":2,"text":"5. Your Use of the Services"},{"id":"_6-privacy-and-your-personal-information","depth":2,"text":"6. Privacy and your personal information"},{"id":"_7-content-in-the-services","depth":2,"text":"7. Content in the Services"},{"id":"_8-allegations-of-copyright-infringement","depth":2,"text":"8. Allegations of Copyright Infringement","children":[{"id":"your-notice-must","depth":3,"text":"Your notice must:"}]},{"id":"_9-licenses","depth":2,"text":"9. Licenses"},{"id":"_10-fees","depth":2,"text":"10. Fees"},{"id":"_11-proprietary-rights","depth":2,"text":"11. Proprietary rights"},{"id":"_12-license-from-maxthon","depth":2,"text":"12. License from Maxthon"},{"id":"_13-software-updates-and-how-to-change-settings-and-uninstall","depth":2,"text":"13. Software updates and how to change settings and uninstall"},{"id":"_14-ending-your-relationship-with-maxthon","depth":2,"text":"14. Ending your relationship with Maxthon"},{"id":"_15-exclusion-of-warranties","depth":2,"text":"15. EXCLUSION OF WARRANTIES"},{"id":"_16-limitation-of-liability","depth":2,"text":"16. LIMITATION OF LIABILITY"},{"id":"_17-advertisements","depth":2,"text":"17. Advertisements"},{"id":"_18-third-party-links","depth":2,"text":"18. Third Party Links"},{"id":"_19-other-content","depth":2,"text":"19. Other content"},{"id":"_20-changes-to-the-terms","depth":2,"text":"20. Changes to the Terms"},{"id":"_21-general-legal-terms","depth":2,"text":"21. General legal terms"},{"id":"_22-additional-terms-for-extensions-for-maxthon-browsers","depth":2,"text":"22. Additional Terms for Extensions for Maxthon Browsers"},{"id":"_23-additional-terms-for-maxthon-cloud-services-and-powered-by-maxthon-cloud-services","depth":2,"text":"23. Additional Terms for Maxthon Cloud Services and \"Powered by Maxthon Cloud services\"","children":[{"id":"_231-these-terms-in-this-section-apply-if-you-use-maxthon-cloud-services-or-a-product-labeled-powered-by-maxthon-cloud-services-on-any-device-computer-or-cloud-services-website","depth":3,"text":"23.1 These terms in this section apply if you use Maxthon cloud services or a product labeled \"Powered by Maxthon cloud services\" on any device, computer or cloud services website."},{"id":"_232-maxthon-cloud-services-available-as-is","depth":3,"text":"23.2 Maxthon Cloud Services Available \"AS-IS\""},{"id":"_233-user-responsibilities","depth":3,"text":"23.3 User Responsibilities"},{"id":"_234-account-security","depth":3,"text":"23.4 Account Security"},{"id":"_235-your-cloud-content-and-privacy","depth":3,"text":"23.5 Your Cloud Content and Privacy"},{"id":"_236-software-and-updates","depth":3,"text":"23.6 Software and Updates"},{"id":"_237-termination","depth":3,"text":"23.7 Termination"}]}]}},"_type":"markdown","_id":"content:en:docs:eula.md","_source":"content","_file":"en/docs/eula.md","_extension":"md"}