{"_path":"/docs/gold","_dir":"docs","_draft":false,"_partial":false,"_locale":"","title":"Gold and Diamond Activity Rules","description":"Dear User,","body":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"gold-and-diamond-activity-rules"},"children":[{"type":"text","value":"Gold and Diamond Activity Rules"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dear User,"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"To protect your rights, please read the following rules carefully:"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Golds is a virtual currency within the Maxthon Browser product, which can be used to exchange for virtual items and services, among others."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Ways of obtaining Golds include but are not limited to: daily check-in, tasks, and activities."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Score in your Maxthon account can be exchanged for Golds in the \"Settings/Basic Settings/Maxthon Cloud Account\" menu. Every point of Score can be exchanged for 10 Golds. The time of exchange will be considered as the acquisition time of the Golds, and their validity period will be calculated from that point."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Due to the problem in calculating the acquisition of Score based on online time for some users, we will make a one-time compensation for you when you exchange Golds."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Once Score is offline, your online time calculation will no longer accumulate, and you will not be able to acquire new Score."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Golds have an expiration date and need to be used within a certain time frame. Any unused Golds that expire will be automatically deducted. Golds obtained in the current year will expire on March 31 of the following year. Any soon-to-be-expired Golds will be displayed in your asset details."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Golds are mainly obtained through daily check-in activities and are displayed on the Maxthon New Tab page. Please note that if you have installed other New Tab page plugins, you may not be able to obtain Golds through daily check-in."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Continuous daily check-in can lead to better rewards. Daily check-in activities operate on a seven-day accumulation cycle, and the Golds obtained from the first to the seventh day of each cycle will be displayed in the daily check-in activity pop-up window. Each time you complete a continuous daily check-in for seven days, the next day's daily check-in will start from the first day again. Please note that if you break the cycle by not signing in for a day, the check-in cycle will start again from the first day."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Diamonds are another virtual currency within the Maxthon Browser product that can only be obtained through top-up. The price for 1000 diamonds is 1 US dollar. When you pay with other currencies, the third-party payment platform will calculate the actual fiat currency payment amount based on the real-time exchange rate."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"If you do not have enough Golds to purchase virtual items or services, you can buy Golds with the diamonds. The price will be shown at the Golds purchase page."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Diamonds have no expiration date, and once top-up is successful, they can be used permanently."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"When exchanging, using Golds, or topping-up and using diamonds, please be sure to pay attention to the following matters:\n"},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Please confirm the security of your account before exchanging or using, to ensure that your account will not be stolen or subject to other risks."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Please carefully review the rules and conditions of the exchange or use before exchanging or using. Some exchanges and uses may have specific restrictions and requirements."}]}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"If you encounter any problems or questions, please contact our customer service team promptly so that we can solve your problem in a timely manner. The final interpretation right of this activity belongs to Maxthon Browser."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maxthon Browser"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\n04/28/2023"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:docs:gold.md","_source":"content","_file":"docs/gold.md","_extension":"md"}