{"_path":"/en/about_us","_dir":"en","_draft":false,"_partial":false,"_locale":"","title":"AboutUs","description":"","body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"introduction-to-maxthon-browser"},"children":[{"type":"text","value":"Introduction to Maxthon Browser"}]},{"type":"element","tag":"h3","props":{"id":"browser-overview"},"children":[{"type":"text","value":"Browser Overview"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maxthon Browser is a web browser developed by the Maxthon team, based on the Chromium open-source project and other open-source software. Maxthon Browser has won widespread acclaim from users worldwide for its unique user experience and innovative features such as cloud service synchronization, mouse gesture operations, Maxnote, UUMail, ad blocker, resource sniffer, and customizable skins.\nAs a professional browser developer in China, Maxthon has been committed to the research and innovation of browser software technology for a long time. Its core product line includes the Maxthon Browser series and supporting online service sites. Maxthon's mission is to integrate all online applications, connecting every person behind the network terminal, to create more convenient ways for people to communicate, share, and access services, thus promoting social progress by empowering individuals.\nThe predecessor of the Maxthon browser was MyIE2, created by founder Jeff Chen out of dissatisfaction with existing browsers on the market. Driven by his pursuit of an ideal browsing experience, he independently developed this product. Later, an Irish user gave MyIE2 a meaningful new name—Maxthon, which cleverly combines \"Max\" (symbolizing peak and excellence) and \"Thon\" (derived from marathon, implying endurance and longevity). The Chinese name \"傲游\" (Ào Yóu) complements the English name, conveying a brand spirit of standing out among peers and continuous progress.\nSince being renamed Maxthon, the browser has achieved significant success in the global market, with active users exceeding tens of millions and a deep user base across 120 countries and regions. Its diverse features are particularly noteworthy, with global users actively participating in product experience and spontaneously translating the browser into 55 language versions, fully demonstrating Maxthon's international influence and high user engagement and loyalty."}]},{"type":"element","tag":"h3","props":{"id":"advantages"},"children":[{"type":"text","value":"Advantages"}]},{"type":"element","tag":"h4","props":{"id":"chromium-plugin-support"},"children":[{"type":"text","value":"Chromium Plugin Support"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In 2023, Maxthon Browser 7.0 achieved a major breakthrough in maintaining seamless compatibility with the Chrome ecosystem, fully supporting all plugins designed and developed for Google Chrome. Users can directly install a vast array of extensions from the Chrome Web Store into the Maxthon browser, enjoying the same rich functionality as Chrome. For developers, the built-in developer mode in Maxthon allows for convenient development and debugging of custom plugins, further enhancing the possibilities for innovation and personalized customization. For users in mainland China, Maxthon Browser has specially optimized localization services, allowing users to access the Maxthon Browser Plugin Center to download and install various practical plugins that comply with local regulations. This provides a safer, smoother, and more tailored web browsing experience."}]},{"type":"element","tag":"h4","props":{"id":"multi-platform-cloud-sync"},"children":[{"type":"text","value":"Multi-Platform Cloud Sync"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maxthon Browser thoughtfully provides an account synchronization service. When users register and log in to their Maxthon account, the cross-platform synchronization feature allows them to share core data and enjoy a consistent experience across different devices and platforms. This synchronization covers essential browsing data such as bookmarks, browser settings, the unique Maxthon Note feature (which facilitates recording and sharing web information), data in the personal password manager, and the quick access URL list."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Moreover, Maxthon Browser particularly addresses the needs of desktop users for extensions by enabling plugin synchronization between Windows and MacOS desktop versions. This means that users can not only install and use their favorite Chrome-compatible plugins on one device, but these plugins and their related data can also migrate with their account to other computer devices. This truly achieves one-stop configuration, ensuring that no matter where they use Maxthon Browser, they can quickly return to their familiar personalized work environment."}]},{"type":"element","tag":"h4","props":{"id":"user-friendly-reading-mode-design"},"children":[{"type":"text","value":"User-Friendly Reading Mode Design"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maxthon Browser offers a carefully designed reading mode, night mode, and dark mode, along with the innovative Read Aloud function, providing users with a comprehensive and high-quality reading experience.\n"},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Reading Mode"}]},{"type":"text","value":" aims to provide users with an immersive reading experience by intelligently removing web ads and other irrelevant elements, retaining only the main text and images, and reformatting the content for a more focused and comfortable article or long-read browsing experience. Additionally, reading mode allows users to adjust font size, style, and background color to meet different visual needs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Night Mode"}]},{"type":"text","value":" is thoughtfully designed for users who use computers for extended periods, reducing screen brightness and adjusting interface colors to warm or dark tones, effectively alleviating eye fatigue, especially suitable for low-light environments. This mode can be turned on automatically or manually, ensuring a healthy and comfortable web browsing experience at any time and place, fully reflecting Maxthon Browser's meticulous attention to user experience details and comprehensive care."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Dark Mode"}]},{"type":"text","value":" is a significant visual optimization feature in Maxthon Browser. In this mode, the browser interface switches to a dark-toned design, with elements such as the background, text, icons, and menu bar adjusted to a low-brightness dark color scheme. This not only follows the current trend of dark interface design, catering to users' personalized aesthetic preferences, but also matches the system settings of Windows and MacOS, enabling automatic activation. This user-friendly design further demonstrates Maxthon Browser's commitment to enhancing user experience and prioritizing user health, reflecting its dedication to thoughtful craftsmanship."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Read Aloud"}]},{"type":"text","value":" is a new feature in Maxthon Browser, designed to offer users a more diverse browsing experience. In this mode, the browser can convert webpage content into audible information using text-to-speech technology, enabling a novel way of “listening to the web.” Whether during a busy commute, while resting your eyes, or in scenarios where reading is inconvenient, users can activate the Read Aloud mode with a single click to have the browser read the current page’s content aloud, freeing their eyes and easily obtaining information."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Additionally, the Read Aloud mode may support customization options such as adjusting the reading speed and voice tone to meet different users' personalized needs. This feature can also be enabled in Reading Mode, where unnecessary elements are removed from the page. When Read Aloud is activated in this state, the webpage content is delivered to users in a clear and smooth voice, providing a more comfortable and immersive auditory reading experience."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In summary, Maxthon Browser achieves multi-dimensional optimization of both visual and auditory aspects through the deep integration and coordinated operation of these features, significantly enhancing users' online reading experience."}]},{"type":"element","tag":"h4","props":{"id":"enhanced-security"},"children":[{"type":"text","value":"Enhanced Security"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maxthon Browser understands the increasing importance of personal data privacy protection in the digital age. To ensure users' safety while surfing the web, Maxthon employs a series of advanced encryption technologies and security measures:"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Encrypted Storage"}]},{"type":"text","value":": Maxthon Browser encrypts users' account information, passwords, bookmarks, and other sensitive data, ensuring high confidentiality even when stored locally or in the cloud."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Incognito Mode"}]},{"type":"text","value":": Provides a private browsing window feature that allows users to browse the web without leaving any history records, cache files, or cookies, preventing unintentional disclosure of personal information."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Anti-Tracking Technology"}]},{"type":"text","value":": Built-in anti-tracking mechanisms effectively block third-party websites and advertisers from monitoring users' online behavior, protecting users' web footprint privacy."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Security Updates and Protection"}]},{"type":"text","value":": Regularly releases security patches and optimizes kernel security performance to counteract the latest online threats and malware attacks."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Account Sync Security"}]},{"type":"text","value":": For users who choose to use the Maxthon account sync feature, their data is also strictly encrypted during synchronization, preventing interception during transmission. Through these multi-level, comprehensive security strategies, Maxthon Browser is dedicated to providing a highly efficient and secure internet access environment for global users, ensuring that users can enjoy superior security guarantees during both everyday browsing and critical operations."}]}]},{"type":"element","tag":"h4","props":{"id":"rich-and-comprehensive-additional-features"},"children":[{"type":"text","value":"Rich and Comprehensive Additional Features"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Beyond basic browsing functionality, Maxthon Browser offers a series of rich and comprehensive additional features designed to provide users with a more convenient and efficient online experience. For example:"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Smart Form Filling"}]},{"type":"text","value":": Automatically saves and fills in users' login information, greatly simplifying the cumbersome login process and improving the efficiency of web form filling."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Adblock Plus"}]},{"type":"text","value":": Built-in ad blocking plugin effectively blocks annoying web ads, creating a cleaner and more focused browsing environment."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Incognito Window"}]},{"type":"text","value":": Provides an independent incognito window feature for multi-account online needs, allowing users to manage multiple accounts within the same browser without interference."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Resource Sniffer"}]},{"type":"text","value":": A powerful and practical tool that detects and downloads multimedia resources such as images, audio, and video from web pages, making it convenient for users to collect or view offline."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Split Screen Browsing"}]},{"type":"text","value":": Innovatively achieves multi-page simultaneous display, allowing users to open multiple web pages side by side in the same window, facilitating comparison, cross-reference, or collaborative work, significantly enhancing multitasking capabilities."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Maxnote"}]},{"type":"text","value":": Built-in cloud-synced note-taking feature allows users to record, organize, and share web content anytime, anywhere, aiding in knowledge management and information collection."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Screenshot Tool"}]},{"type":"text","value":": This integrated advanced screenshot feature supports various capturing methods, including full-screen, region, and selected window screenshots. Users can instantly edit and save their captures, catering to diverse screenshot needs in everyday study, work, and entertainment scenarios."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"BrightVPN"}]},{"type":"text","value":" (available only in overseas versions): A free IP proxy tool that can change IP addresses."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Video Download"}]},{"type":"text","value":": Integrated in the video floating toolbar, allows downloading most videos from mainstream video players."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In conclusion, through the thoughtful design and integration of these practical tools, Maxthon Browser comprehensively enhances the user experience. It allows users to enjoy fast and stable basic browsing services while also benefiting from personalized value-added services and efficient work assistance features."}]},{"type":"element","tag":"h4","props":{"id":"integrated-ai-chat-tool-ai-chat"},"children":[{"type":"text","value":"Integrated AI Chat Tool AI Chat"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A major highlight of this version is the integration of an AI Chat Tool. This innovative feature transforms the browser from merely a web browsing platform into an intelligent interaction center. With the built-in AI chat assistant, users can effortlessly engage in natural language conversations with the browser. Utilizing advanced natural language understanding and generation technologies, this AI chat tool can deeply comprehend users' intentions and provide valuable feedback, significantly enhancing convenience and efficiency during the browsing experience."}]},{"type":"element","tag":"h3","props":{"id":"development-history"},"children":[{"type":"text","value":"Development History"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In 2000, a developer known online as Changyou developed an enhanced browser based on Internet Explorer named MyIE. The original author posted a notice: \"free development, experts can modify it themselves\" and then lost contact. Jeff Chen took over the development out of interest."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2003: Released the web browser named MyIE2."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2004: MyIE2 was renamed to Maxthon, the Chinese name being 傲游 (AoYou), and released version 1.0 based on Trident and Gecko engines."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2006: Maxthon moved into Zhongguancun offices; released Maxthon Browser version 2.0, dropping Gecko support."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2007: Main site download count exceeded 100 million."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2008: Maxthon, along with Internet Explorer 7, Mozilla Firefox, Opera, and Safari, won the CNET Webware 100 browser category award."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2009: Main site download count exceeded 200 million; released 3.0 Alpha with WebKit engine; won CNET Webware 100 again. This time, the award-winning browsers included Internet Explorer 8, Mozilla Firefox, Flock, Opera, Safari, and Google Chrome."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2012: Released Maxthon Cloud Browser on December 10. Maxthon Browser occupied a considerable market share in mainland China, with download counts exceeding 50% on platforms like 360 Software Manager."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2014: On February 20, Maxthon Browser released a new version featuring a video fast-forward function, allowing users to select the playback progress, including fast-forwarding through ads."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2016: Maxthon released Maxthon Browser 5, a product centered on powerful cloud services aimed at providing users with a seamless, efficient cross-device browsing experience. New features such as Maxnote, Passkeeper, and UUMail were introduced, making Maxthon 5 a personal assistant for users."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2020: Maxthon released Maxthon Browser 6. The new browser emphasized the integration and application of blockchain technology, providing 64-bit and 32-bit versions for Windows systems, as well as versions for iOS, Android mobile devices, and a portable Windows version. The new version transitioned to a Chromium-based infrastructure while still maintaining compatibility with dual rendering engines Trident and Blink."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2023: In 2023, Maxthon Browser entered a new stage of development with the official release of its groundbreaking version 7.0. Building on the solid foundation of the features and exceptional performance accumulated in the Maxthon 6 series, version 7.0 takes things further by closely aligning with the cutting-edge trends and technological demands of the WEB 3.0 era, introducing deep innovations and enhanced functionalities."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This new version features a built-in AI chat assistant, enabling users to enjoy the convenience and efficiency of intelligent conversations, information retrieval, and interaction while browsing the web. Additionally, catering to the growing demand for multimedia content consumption, Maxthon Browser 7.0 integrates a powerful video download plugin, allowing users to smoothly watch online videos and effortlessly download and save their favorite content locally, greatly enriching their digital life experience."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Through these significant updates and many other new features, Maxthon Browser 7.0 not only solidifies its position as an advanced browser but also powerfully demonstrates the Maxthon team's profound insight into and proactive response to the future development of the web ecosystem. The goal is to provide global users with more intelligent, personalized, and comprehensive web services, leading the way in browser technology and application development in the WEB 3.0 era."}]},{"type":"element","tag":"h3","props":{"id":"icon-evolution"},"children":[{"type":"text","value":"Icon Evolution"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Maxthon 1.x/2.x era: With the brand renamed to Maxthon and the official release of the browser, its icon design began to have a unique recognition. The early Maxthon browser icons primarily used blue tones combined with elements such as the globe and the letter \"M,\" reflecting the brand's global vision and sense of technology."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Maxthon 3.x/4.x versions: During this period, the icons were likely optimized and upgraded based on the original, becoming more modern and concise, possibly retaining some of the original design concepts while enhancing brand image expression, strengthening the \"M\" letter mark, and adopting more popular flat design styles."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Maxthon 5.x/6.x and later: With the trend of flat design, the Maxthon browser icons underwent further simplification and abstraction, aligning more with modern aesthetic standards. The icons likely removed unnecessary details, pursuing a design style with clear lines and defined outlines, ensuring clarity on various resolutions and devices."}]}]},{"type":"element","tag":"img","props":{"src":"../../img/iconhistory.png","alt":"Evolution of Maxthon Browser Icons","style":"width: 100%;"},"children":[]},{"type":"element","tag":"h3","props":{"id":"supported-platforms"},"children":[{"type":"text","value":"Supported Platforms"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The current version of Maxthon Browser covers multiple mainstream operating system platforms, ensuring consistent and smooth browsing experiences for users on different devices. Below is a brief description of the six major platform versions:"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Windows Desktop Installation Version"}]},{"type":"text","value":": Designed for Windows operating systems, suitable for most Windows PC users. Whether 64-bit or 32-bit operating systems, it perfectly adapts, providing stable, comprehensive features and good compatibility."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Windows Desktop Portable Version"}]},{"type":"text","value":": Also known as Portable or Green version, it does not require formal installation and can run directly from a USB drive or other portable storage devices. User data can be carried around, convenient for use on multiple computers without worrying about settings and bookmark synchronization issues."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"MacOS Version"}]},{"type":"text","value":": Customized for Apple Mac computer users, fully considering the interface style and user experience habits of the Mac operating system, ensuring the same efficient web browsing services on the Mac platform as the Windows version."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"iOS Version"}]},{"type":"text","value":": Suitable for iPhone operating systems, offering an interface and features optimized for mobile devices, fully utilizing touch screen operation characteristics, allowing users to enjoy Maxthon Browser services on iOS devices."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"iPad Version"}]},{"type":"text","value":": The Maxthon Browser app dedicated to iPads, designed and optimized specifically for the iPad's large screen, providing an excellent web browsing experience for tablet users."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Android Version"}]},{"type":"text","value":": Designed for the vast number of Android smartphone and tablet users, offering a highly customizable and feature-rich browser application that supports various plugin extensions. It has been deeply optimized for the diversity of Android systems, ensuring a fast, secure, and personalized browsing experience on different Android devices."}]}]},{"type":"element","tag":"h3","props":{"id":"interface-features"},"children":[{"type":"text","value":"Interface Features"}]},{"type":"element","tag":"h4","props":{"id":"new-tab-page"},"children":[{"type":"text","value":"New Tab Page"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The design of the new tab page in Maxthon Browser is not only practical and convenient but also focuses on personalization and user experience enhancement. In the new version, users can see a series of carefully preset commonly used links as soon as they open a new tab. These links can be customized or deleted according to user habits, and corresponding operation options can be called up by simply hovering the mouse over the link."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Additionally, the new tab page supports quick access grouping. Users can organize different web page tabs through simple mouse drag operations for easy management and switching. Users can also adjust the position order of the tabs according to personal preferences, making frequently visited or higher-priority websites quickly accessible."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Moreover, the new tab page in Maxthon Browser integrates rich additional features and services, such as daily sign-in activities to increase user interaction and stickiness, a built-in efficient search engine for convenient information retrieval, real-time weather forecasts providing thoughtful life assistant services, and background image change functions to meet users' pursuit of personalized interfaces."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Users can also choose the display mode according to their preferences, change the display format of quick access URLs, and hide certain functions or modules, making each opening of a new tab page feel like opening a multi-functional window that integrates information, tools, and entertainment, greatly enriching the user's browsing experience."}]},{"type":"element","tag":"h4","props":{"id":"multifunctional-address-bar"},"children":[{"type":"text","value":"Multifunctional Address Bar"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maxthon Browser innovatively achieves seamless integration of the address bar and search box, significantly enhancing user operation efficiency. Whether users enter a URL or a keyword they want to search for in the address bar, the browser will intelligently recognize and process it accordingly, achieving one-click direct access to the target webpage or quickly presenting relevant search results."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This unified search and address bar feature has powerful intelligent matching characteristics. It provides users with precise and efficient search suggestions in real-time based on information from multiple sources, such as saved bookmarks, currently opened tabs, browsing history, and popular trends on the web. This intelligent design allows users to easily find the required content without switching to a separate search engine page."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Additionally, Maxthon Browser fully respects and meets users' personalized needs by allowing them to freely change the default search engine settings. With just a few simple steps, users can link the address bar to their most frequently used search engine. Furthermore, the search box in the new tab page preset also supports easy switching between different search engines, ensuring that users can optimize their search experience according to personal preferences and needs. Through such feature integration and flexible settings, Maxthon Browser truly realizes the possibility of searching everything from a single address bar, providing users with a more streamlined, efficient, and personalized browsing experience."}]},{"type":"element","tag":"h4","props":{"id":"search-toolbar"},"children":[{"type":"text","value":"Search Toolbar"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The search toolbar in Maxthon Browser is a multi-functional component that combines efficiency, convenience, and intelligence. It is located in a prominent position in the browser window, usually adjacent to the address bar, providing users with one-click search services. Users do not need to specifically open a search engine website; they can directly enter keywords or URLs in the search toolbar, and the browser will quickly recognize and execute the corresponding operations.\nMoreover, the design of Maxthon Browser's search toolbar is user-friendly, allowing users to customize search engine options according to personal preferences. It can remember and learn users' search habits, continuously improving the personalization of the search experience. This powerful and flexible feature not only significantly enhances users' search efficiency but also makes the entire browsing process smoother and more comfortable."}]},{"type":"element","tag":"h4","props":{"id":"tabs"},"children":[{"type":"text","value":"Tabs"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In Maxthon Browser, the tab function is a core browsing experience optimization design. Users can open multiple web pages in the same window and quickly switch and manage them through tabs at the top, with each tab representing an independent web page. This design not only saves screen space significantly, improving desktop environment work efficiency but also makes multitasking more intuitive and convenient. Specifically, users can use the tab function in the following ways:"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Open a new tab: Click the plus button behind the address bar or use shortcuts to create a new blank tab; you can also enter a URL or search keyword in the address bar to create a new tab."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Switch tabs: Simply click the tab name to immediately jump to that page."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Close tabs: Hover the mouse over the tab to display the close button, and click to close the current tab; you can also use keyboard shortcuts to quickly close it."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Drag and organize tabs: Users can drag tabs to change their order or drag a tab to another position in the current window, the other side of a split-screen window, or another open browser window; it also supports tab grouping, facilitating the management and organization of web page content with similar themes or related topics."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Restore closed tabs: If you accidentally close a tab, there's no need to worry. Maxthon Browser provides a function to restore recently closed tabs. In summary, the tab function in Maxthon Browser makes users' web browsing experience smoother and more efficient, allowing for convenient operations and flexible management, whether in daily work, study, or entertainment."}]}]},{"type":"element","tag":"h4","props":{"id":"tab-grouping"},"children":[{"type":"text","value":"Tab Grouping"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The tab grouping feature in Maxthon Browser is a practical tool designed to efficiently manage multiple open web pages. By grouping tabs, users can organize multiple tabs related to the same theme or task into one logical unit, making it easier to view and switch quickly.\nIn specific operations, users can create new groups by dragging tabs together or name different groups for easy identification and memory. When users have a large number of simultaneously opened web pages, tab grouping can effectively reduce visual clutter, improve work efficiency, and easily expand or collapse entire groups as needed, saving screen space.\nMoreover, Maxthon Browser supports saving and restoring tab groups, meaning that even if the browser is closed, the previous group state can be quickly restored upon the next startup, significantly enhancing the continuity and convenience of the user experience. This powerful tab grouping function makes users' web browsing and management work more organized and handy."}]},{"type":"element","tag":"h4","props":{"id":"maxnote"},"children":[{"type":"text","value":"Maxnote"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maxnote is a powerful and convenient cloud-synced note-taking tool built into Maxthon Browser, designed to help users quickly record, organize, and share information while browsing the web. This feature allows users to create, edit, and save note content anytime, anywhere, whether it's URLs, text, images, or links. Users can use Maxnote for web clipping, directly saving interesting content to notes, while providing various formatting options for later review and organization.\nAdditionally, Maxnote has cross-device sync functionality. As long as the Maxthon account is logged in, users can view and edit their notes in real-time, whether on the Windows desktop version, MacOS version, or iOS and Android mobile devices, achieving seamless information flow and efficient work and study experiences. In short, as a core feature embedded in the browser, Maxthon Browser enables users to more effectively collect, organize, and utilize valuable information resources while surfing the web."}]},{"type":"element","tag":"h4","props":{"id":"super-bookmarks"},"children":[{"type":"text","value":"Super Bookmarks"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The newly launched \"Super Bookmarks\" feature in Maxthon Browser is a VIP exclusive service that requires a subscription to Maxthon VIP to enable. This feature combines URL bookmarks and note management, allowing users to build a personal knowledge base.\nAfter enabling \"Super Bookmarks,\" users can adjust related options in Settings > Function Management > Super Bookmarks, such as displaying specific Maxnote folders in the bookmarks bar and customizing the Super Bookmarks directory. Additionally, users can choose whether to display note-type records in the bookmarks bar and bookmarks menu.\nDuring the initial activation, it is recommended to import existing browser bookmarks into the \"My Bookmarks Folder\" in Maxnote. When using Super Bookmarks, entries in the bookmarks bar will be color-coded to distinguish \"My Favorites,\" and it also supports adjusting the order of URLs and notes in Maxnote.\nCompared to traditional bookmarks, URLs in Super Bookmarks also support adding notes. When opening the corresponding URL, the note content will be displayed in the lower right corner of the screen. If users decide to disable Super Bookmarks, the original bookmark manager data will be restored.\nAdditionally, users can export all bookmarks (URL type only) from Maxnote for re-importing into the bookmark manager after disabling Super Bookmarks.\nIn summary, the \"Super Bookmarks\" feature aims to enhance users' browsing efficiency, integrating resource management and web bookmarks to create a personalized and efficient web experience."}]},{"type":"element","tag":"h4","props":{"id":"status-bar"},"children":[{"type":"text","value":"Status Bar"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In Maxthon Browser, users can enable the status bar by clicking the custom interface logo icon in the top right corner, navigating to the settings menu, and selecting the \"Show Status Bar\" option. Once enabled, the status bar will appear at the bottom or top of the browser (depending on the browser version and settings), providing users with a range of convenient operation shortcuts and real-time information displays. In the secondary menu of the status bar, users can further customize the functions displayed in the status bar, including but not limited to the following items:"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"CPU Efficiency Monitoring: Users can enable monitoring of the browser's CPU resource usage, viewing the impact of current web browsing on system performance in real-time, facilitating resource management and optimization."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Mute Control: Quickly switch whether the browser is muted, convenient for users to disable all web sounds with one click when a quiet environment is needed."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Page Zoom: Perform page zoom operations directly in the status bar without searching for zoom buttons on the page, especially convenient for users with poor eyesight or those switching between different devices."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Split-Screen Function: If supported, quickly enable the browser's split-screen mode, allowing users to open multiple web pages side by side in the same window for multitasking."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Full-Screen Mode: Enter or exit full-screen browsing mode with one click, providing a more immersive browsing experience. Additionally, in certain versions or specific scenarios, users can right-click the CPU efficiency monitoring area in the status bar to set detailed monitoring for multiple online indicators such as network speed and memory usage, better grasping and managing the browser's operating status."}]}]},{"type":"element","tag":"h4","props":{"id":"split-screen-browsing"},"children":[{"type":"text","value":"Split Screen Browsing"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Split-screen browsing is an important feature in modern operating systems and advanced applications, making multitasking more intuitive and convenient. This is especially useful for scenarios that require cross-window collaboration and comparison of information. In Maxthon Browser, users can enable the split-screen browsing feature through specific keyboard shortcuts or menu options, thereby enhancing browsing efficiency. The default shortcut for split-screen browsing in Maxthon Browser is F10. Users can also access and manage the split-screen browsing feature through the browser's menu options."}]},{"type":"element","tag":"h4","props":{"id":"mouse-gestures"},"children":[{"type":"text","value":"Mouse Gestures"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The mouse gesture function in Maxthon Browser is a very practical and user-friendly navigation tool. It allows users to trigger preset action commands by drawing specific mouse tracks in the browser window, greatly improving browsing efficiency. Specifically, the mouse gesture function allows users to draw lines, arcs, and other shapes on the page to execute commands after holding down the right mouse button (or left button, depending on user preferences).\nThrough Maxthon Browser's settings center, users can customize the actions corresponding to mouse gestures according to personal habits, making the browsing experience more personalized and efficient. This feature is particularly suitable for users who frequently switch between web pages and perform frequent operations, allowing them to complete tasks that would otherwise require multiple clicks in an instant, saving a significant amount of time and effort."}]},{"type":"element","tag":"h4","props":{"id":"video-download"},"children":[{"type":"text","value":"Video Download"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maxthon Browser offers a convenient and efficient video download feature, allowing you to easily save videos played on web pages. This feature is free for all logged-in users and provides a limited number of full video downloads. While browsing and playing videos, simply find and click the download button on the video’s floating toolbar to start the download. It's important to note that this feature is only available on the full playback interface of videos and cannot directly download videos from lists."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"During the video download process, you can customize the video's name and download path, ensuring the video is stored in the desired location. Additionally, Maxthon Browser offers more benefits to its members, who can enjoy more free downloads to meet higher video download frequency needs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maxthon Browser's video download function aims to simplify the process of saving videos from the web, providing high-quality, convenient services that allow users to easily save their favorite video content locally while enjoying online surfing."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"introduction-to-maxthon-browser","depth":2,"text":"Introduction to Maxthon Browser","children":[{"id":"browser-overview","depth":3,"text":"Browser Overview"},{"id":"advantages","depth":3,"text":"Advantages"},{"id":"development-history","depth":3,"text":"Development History"},{"id":"icon-evolution","depth":3,"text":"Icon Evolution"},{"id":"supported-platforms","depth":3,"text":"Supported Platforms"},{"id":"interface-features","depth":3,"text":"Interface Features"}]}]}},"_type":"markdown","_id":"content:en:about_us.md","_source":"content","_file":"en/about_us.md","_extension":"md"}