{"_path":"/en/docs/vip","_dir":"docs","_draft":false,"_partial":false,"_locale":"","title":"Maxthon Browser Member Service Agreement","description":"Updated on May 1st, 2023\nEffective date: May 1st, 2023","body":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"maxthon-browser-member-service-agreement"},"children":[{"type":"text","value":"Maxthon Browser Member Service Agreement"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Updated on May 1st, 2023"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nEffective date: May 1st, 2023"}]},{"type":"element","tag":"h2","props":{"id":"introduction"},"children":[{"type":"text","value":"Introduction"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Welcome to the membership program of Maxthon Browser, an online browsing service that provides its users with a comprehensive and reliable internet browsing experience. Our membership program is designed to provide our users with additional features and benefits that will enhance their browsing experience."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"By joining our membership program, you agree to abide by the terms and conditions outlined in this Membership Service Agreement (the \"Agreement\"). We recommend that you read this Agreement carefully before joining our membership program."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This agreement is based on the “Maxthon Software and Services Terms of Service & End User License Agreement”, “Maxthon Software and Services Terms of Service & End User License Agreement”, and other relevant agreements and specifications related to Maxthon Browser (collectively referred to as \"Maxthon Browser Service Terms\"), which cannot be separated from it. At the same time, any relevant agreements and activity rules related to members that Maxthon Browser occasionally publishes are also part of this agreement. By using the membership service, you should comply with all the terms of this agreement, the Maxthon Browser Service Terms, and the aforementioned relevant agreements and activity rules."}]},{"type":"element","tag":"h2","props":{"id":"membership"},"children":[{"type":"text","value":"Membership"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"To become a member of the Maxthon Browser membership program, you must register with us by providing your name, email address, and other relevant information. By registering, you represent and warrant that all information provided by you is true, accurate, current, and complete."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We reserve the right to accept or reject any application for membership at our sole discretion without disclosing the reasons for our decision. If we reject your application, any fees you have paid will be refunded to you."}]},{"type":"element","tag":"h2","props":{"id":"password-and-security"},"children":[{"type":"text","value":"Password and Security"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You are solely responsible for maintaining the confidentiality of your account and password and for restricting access to your computer. You agree to accept responsibility for all activities that occur under your account or password. You should take all necessary steps to ensure that your password is kept confidential and secure and should inform us immediately if you have any reason to believe that your password has become known to anyone else, or if the password is being, or is likely to be, used in an unauthorized manner."}]},{"type":"element","tag":"h2","props":{"id":"membership-fees"},"children":[{"type":"text","value":"Membership Fees"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Membership fee is an ongoing subscription fee that is charged on a monthly basis. The fee amount and payment schedule are subject to change at our sole discretion upon reasonable notice to you."}]},{"type":"element","tag":"h2","props":{"id":"cancellation-and-refunds"},"children":[{"type":"text","value":"Cancellation and Refunds"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You may cancel your membership at any time by visiting the “Maxthon Membership” page on our website and following the instructions provided there. Your membership subscription will be cancelled immediately upon receipt of your cancellation request."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We do not offer refunds for any membership fees that have already been paid, except in cases where we have made a mistake in charging you or in other extraordinary circumstances."}]},{"type":"element","tag":"h2","props":{"id":"intellectual-property-rights"},"children":[{"type":"text","value":"Intellectual Property Rights"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Maxthon Browser and its associated logos are registered trademarks of our company. All content on the Maxthon Browser website, including text, graphics, logos, images, and software, is the property of Maxthon Browser and is protected by copyright laws."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You agree not to use any content on our website for commercial or non-commercial purposes without our prior written consent. Any unauthorized use of our content without our prior written consent is strictly prohibited and may result in legal action being taken against you."}]},{"type":"element","tag":"h2","props":{"id":"limitation-of-liability"},"children":[{"type":"text","value":"Limitation of Liability"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In no event shall Maxthon Browser be liable for any direct, indirect, incidental, special, or consequential damages arising out of or in connection with the membership program, including, without limitation, damages for loss of profits, data, or other intangible losses (even if we have been advised of the possibility of such damages)."}]},{"type":"element","tag":"h2","props":{"id":"indemnity"},"children":[{"type":"text","value":"Indemnity"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You agree to indemnify and hold harmless Maxthon Browser, its directors, officers, employees, and agents from and against any and all claims, expenses, damages, and liabilities (including reasonable attorney's fees) arising from or in connection with your use of the membership program."}]},{"type":"element","tag":"h2","props":{"id":"governing-law-and-jurisdiction"},"children":[{"type":"text","value":"Governing Law and Jurisdiction"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This Agreement shall be governed by and interpreted in accordance with the laws of the country or region in which you use the Maxthon Browser membership program. Any disputes arising out of or in connection with this Agreement shall be resolved by the courts of the country or region in which you use the membership program."}]},{"type":"element","tag":"h2","props":{"id":"changes-to-this-agreement"},"children":[{"type":"text","value":"Changes to this Agreement"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We reserve the right to modify this Agreement from time to time at our sole discretion. We will notify you of any changes to this Agreement by posting the modified Agreement on our website. Your continued use of the membership program after the posting of any changes constitutes your acceptance of the modified Agreement."}]},{"type":"element","tag":"h2","props":{"id":"entire-agreement"},"children":[{"type":"text","value":"Entire Agreement"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This Agreement constitutes the entire agreement between you and Maxthon Browser with respect to the membership program and supersedes all prior agreements or understandings, whether written or oral, related to the membership program."}]},{"type":"element","tag":"h2","props":{"id":"contact-us"},"children":[{"type":"text","value":"Contact Us"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you have any questions about this Agreement or the Maxthon Browser membership program, please contact us at "},{"type":"element","tag":"a","props":{"href":"mailto:help@maxthon.com"},"children":[{"type":"text","value":"help@maxthon.com"}]},{"type":"text","value":"."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"introduction","depth":2,"text":"Introduction"},{"id":"membership","depth":2,"text":"Membership"},{"id":"password-and-security","depth":2,"text":"Password and Security"},{"id":"membership-fees","depth":2,"text":"Membership Fees"},{"id":"cancellation-and-refunds","depth":2,"text":"Cancellation and Refunds"},{"id":"intellectual-property-rights","depth":2,"text":"Intellectual Property Rights"},{"id":"limitation-of-liability","depth":2,"text":"Limitation of Liability"},{"id":"indemnity","depth":2,"text":"Indemnity"},{"id":"governing-law-and-jurisdiction","depth":2,"text":"Governing Law and Jurisdiction"},{"id":"changes-to-this-agreement","depth":2,"text":"Changes to this Agreement"},{"id":"entire-agreement","depth":2,"text":"Entire Agreement"},{"id":"contact-us","depth":2,"text":"Contact Us"}]}},"_type":"markdown","_id":"content:en:docs:vip.md","_source":"content","_file":"en/docs/vip.md","_extension":"md"}